//
//  NotificationContent.swift
//  ChuckchuDrivenDevelopment
//
//  Created by Ye Eun Choi on 2023/07/25.
//
import Foundation
// MARK: - NotificationTitle (Struct)
/// 로컬 푸시 알림의 타이틀 내용을 정의합니다.
struct NotificationTitle {
    
    let openingVariations: [String] = [
        "오늘도 활기찬 하루!\n제가 힘을 실어드릴게요! 🐢"
    ]
    
    let variations: [String] = [
        "똑똑, 척추요정 왔어요 🧚",
        "저는 원래 거북목이지만 주인님은… 🐢",
        "스트레칭 한 번으로 허리 수술비 아끼기! 💸",
        "고생하는 허리를 위해 스트레칭 어때요? 💪",
        "허리 쭉쭉! 시원하게 기지개 한 번 🌈",
        "제 알림이 귀찮다구요? 허리가 아파봐야…🔥",
        "건강한 척추에 건강한 정신이 깃든다! 😌",
        "하하! 주인님, 저처럼 굽지않게 조심하세요 🐢",
        "허리도 척추도 꿋꿋하게! 🎋",
        "앉은 자리에서 기지개 한번 쭉~ 🙌",
        "어깨 한 번 돌리고~ 💞",
        "척추 건강으로 더 효율적인 업무! 💪🦋",
        "일과중에도 허리에 힘! 👊",
        "바른 자세, 행복한 하루! 🌟🧘‍♂️",
        "거북목 예방을 위한 자세 체크! 🐢👀",
        "거북목은 개발자의 숙명? No! 👊",
        "멋진 아이디어는 건강한 척추로부터 💡",
        "주인님 굽은 자세 보고 돌고래가 친구먹재요 🐬",
        "아이고, 목 부러지겠어요! 💥",
        "손목도 한번씩 시원하게 돌려주세요⚡️",
        "허리를 꿋꿋!하게 세워주세요 🥢",
        "헉! 척추가 비명을 지르기전에 꿋꿋! 😱",
        "자세 가다듬고, 산뜻한 마음으로🌷",
        "허리… 살려줘요..! 바른자세 꿋꿋! ⚰️",
        "자세 체크, 레디 셋 고! 🏃💨",
        "자세 한 번 가다듬고 파워 UP! 🔥",
        "어? 굽었다. 당장 스트레칭 고고! 🐬",
        "팔 다리 쭉~! 거북목 예방은 필수! 🐢💪",
        "10초의 바른자세가 10년을 바꾼대요 😘",
        "바른 자세가 척추건강을 책임져요! 💪",
        "주인님, 저보다 거북목이면 어떡해요 😥",
    ]
    
    let closingVariations: [String] = [
        "수고하셨어요!\n내일도 기운차게 만나요! 👋🏻"
        
    ]
    
}
