//
//  NotificationContent.swift
//  ChuckchuDrivenDevelopment
//
//  Created by Ye Eun Choi on 2023/07/25.
//

import Foundation

// MARK: - NotificationTitle (Struct)
/// 로컬 푸시 알림의 타이틀 내용을 정의합니다.
struct NotificationTitle {
    
    let openingVariations: [String] = [
        "오늘도 활기찬 하루!",
        "제가 힘을 실어드릴게요!🐢"
    ]
  
    let variations: [String] = [
        "어? 굽었다.",
        "겸손한 척추네요. 이제는 자신감을 가져도 괜찮아요!",
        "척추 주도 개발 ‘CDD’, 지금입니다.",
        "쨔잔! 허리 한번 펴주세요.",
        "내 척추는 마치 다이아몬드",
        "건강한 개발자, 행복한 개발자! 😊👩‍💻",
        "자세 체크, 눈 쉬기, 더 행복한 코딩! 🧘‍♂️💻",
        "건강하게 코딩, 노티가 도와줘!",
        "스트레칭으로 개발 감성 UP!",
        "휴식도 좋은 개발의 일부에요.",
        "허리 한 번 피고 이어가볼까요? 화이팅이에요!🔥",
        "척추건강의 염원을 담아 ..peace",
        "척추 주도 개발! 레츠고!",
        "스트레칭 하고 기분좋게 다시 시작하세요.",
        "당신의 허리를 구원하러 왔습니다.",
        "허리 업 ~!",
        "오늘의 허리 어쩌면 GOAT🐐",
        "지금은 리프레쉬 타임!",
        "어깨 한번 돌리고 목을 뒤로 쭉 ~",
        "허리…! 살려줘요..!",
        "눈, 목 피로? 몸은 내 몸! 쉬는 시간, GO!",
        "팔 다리 쭉~! 거북목 예방은 필수! 🐢💪",
        "자세교정, 미세한 움직임에서 시작해요.",
        "릴렉스, 거북목 no more",
        "눈, 목 케어, 행복 개발!",
        "잠깐 일어나서 바람 한 번 쐬주세요.",
        "거북목 올킬!",
        "똑똑! 눈과 목을 잠시 쉬어줄 시간입니다.",
        "10초의 스트레칭으로 10년을 구하러 왔어요.",
        "허리 가다듬고, 산뜻한 마음으로🌷",
        "Commit: 건강한 개발자가 되어봐요.",
        "척chu~",
        "눈깜빡, 목돌려, 스트레칭 완료"
    ]
    
    let closingVariations: [String] = [
        "수고하셨어요!",
        "내일도 기운차게 만나요!👋🏻"
    ]
    
}
